const questionBank = [
  {
    question: "ما هو الركن الأول من أركان الإسلام؟",
    options: ["الصلاة", "الزكاة", "الشهادتين", "الصوم"],
    answer: "الشهادتين",
  },
  {
    question: "كم عدد ركعات صلاة الفجر؟",
    options: ["ركعتان", "ثلاث ركعات", "أربع ركعات", "خمس ركعات"],
    answer: "ركعتان",
  },
  {
    question: "ما هو الكتاب المقدس في الإسلام؟",
    options: ["الإنجيل", "التوراة", "القرآن", "الزبور"],
    answer: "القرآن",
  },
  {
    question: "من هو آخر الأنبياء في الإسلام؟",
    options: ["موسى", "عيسى", "محمد", "إبراهيم"],
    answer: "محمد",
  },
  {
    question: "ما هو الشهر الذي يصوم فيه المسلمون؟",
    options: ["رجب", "شعبان", "رمضان", "ذو الحجة"],
    answer: "رمضان",
  },
];

export default questionBank;
